Revit 2027 API
Connector.AssignedDuctFlowConfiguration Property
The assigned duct flow configuration of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctFlowConfigurationType AssignedDuctFlowConfiguration { get; }
Public ReadOnly Property AssignedDuctFlowConfiguration As DuctFlowConfigurationType
	Get
public:
property DuctFlowConfigurationType AssignedDuctFlowConfiguration {
	DuctFlowConfigurationType get ();
}
member AssignedDuctFlowConfiguration : DuctFlowConfigurationType with get
Property Value
DuctFlowConfigurationType
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's domain is not DomainHvac. Thrown when the connector is not in a family instance.
InvalidOperationException |  Thrown on failure to get duct flow configuration.
Remarks
Assigned duct flow configuration may be assigned for connectors of some family instances.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace